[{"content_of_the_post": "This list got me thinking about the meaning of these objectives for me. ⁠⁠An 𝗲𝗻𝘁𝗿𝗲𝗽𝗿𝗲𝗻𝗲𝘂𝗿'𝘀 𝗺𝗶𝗻𝗱 means taking charge and being responsible for everything that goes down. ⁠⁠It means being open to different perspectives and possibilities, rather than just saying no. ⁠⁠It means prioritizing action over planning and always looking to learn more. ⁠⁠An 𝗮𝘁𝗵𝗹𝗲𝘁𝗲'𝘀 𝗯𝗼𝗱𝘆 means eating healthy and working out daily. ⁠⁠It means going to bed early and getting a solid 8 hours of sleep. ⁠⁠It means taking time to relax and clear your mind through stretching and meditation, and even trying out fasting and cold exposure. ⁠⁠An 𝗮𝗿𝘁𝗶𝘀𝘁'𝘀 𝘀𝗼𝘂𝗹 means being open to new experiences and finding ways to tap into your creativity. ⁠⁠It means trusting your gut, even if you can't put it into words. ⁠⁠It means being authentic.⁠👉 What do they mean to you?⁠🧩", "content_media": "https://media.licdn.com/dms/image/D5610AQGFrfnxcG8duA/image-shrink_800/0/1683548404417?e=1684720800&v=beta&t=bZAUr5PBW_ftUPH6J6o0yoLMEV1vj2JitfbSE-31SB4", "date": "May-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7061313832127791104", "number_of_likes": 20, "number_of_comments": 18}, {"content_of_the_post": "I had a great chat with Maurizio a few weeks ago. Here's a short video about a different angle to networking that made it click for me.🧩", "content_media": null, "date": "May-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7059498137979142144", "number_of_likes": 8, "number_of_comments": 0}, {"content_of_the_post": "Have you ever heard of the fresh start effect? It's when we're more likely to take action toward a goal after a special event or date has passed. Examples include New Year's Day, the first day of the month, or even a Monday. These can act as mental triggers for us to start something new. 👉 I learned about a strategy to create even more chances for fresh starts - dividing the day into smaller segments like 𝗺𝗼𝗿𝗻𝗶𝗻𝗴, 𝗮𝗳𝘁𝗲𝗿𝗻𝗼𝗼𝗻, 𝗮𝗻𝗱 𝗲𝘃𝗲𝗻𝗶𝗻𝗴. This way, if you miss an opportunity to do something, you can try again in a few hours. For example, if you have a tough morning, don't let it ruin the whole day - you can start fresh in the afternoon.🧩", "content_media": "https://media.licdn.com/dms/image/D5610AQEnvQac7HBoNg/image-shrink_800/0/1682943603221?e=1684720800&v=beta&t=ef936PfdtaO-WXizENwut7Zdrn_HhxvAklR-6x9CRzA", "date": "May-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7058777132696571904", "number_of_likes": 23, "number_of_comments": 4}, {"content_of_the_post": "L’amore non ha confini, puó solo moltiplicarsi", "content_media": null, "date": "May-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7057820507366191105", "number_of_likes": 0, "number_of_comments": 0}, {"content_of_the_post": "My greatest hits", "content_media": "https://media.licdn.com/dms/image/D5610AQGkykA9cHZAlw/image-shrink_800/0/1680351602409?e=1684720800&v=beta&t=eMCLTTRZ6dCcWwEHiFtbAGMw8wpD8cna8CO3YB877eQ", "date": "April-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7047905476109373440", "number_of_likes": 17, "number_of_comments": 2}, {"content_of_the_post": "Congrats TELUS!𝗥𝗲𝗮𝗱𝗲𝗿𝘀' 𝗖𝗵𝗼𝗶𝗰𝗲 𝟮𝟬𝟮𝟯• Major Carrier: Among the [...] carriers that provide nationwide coverage, Telus comes out on top and earns a Readers' Choice Award• MVNO Carrier: Public Mobile blows away the competition on most of our satisfaction measures, earning the Telus subsidiary a Readers' Choice Award𝗕𝘂𝘀𝗶𝗻𝗲𝘀𝘀 𝗖𝗵𝗼𝗶𝗰𝗲 𝟮𝟬𝟮𝟯• Business Carrier: Public Mobile is an MVNO owned by Telus and uses the Telus Mobility network. It offers low fees and high reliability, which propel it to the top of the list of carriers Canadians prefer for work", "content_media": null, "date": "April-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7047635988906446848", "number_of_likes": 6, "number_of_comments": 0}, {"content_of_the_post": "Hi Linkedin,🎙️ We're back with the second and last part of the Careers in the Cloud podcast, in which we discuss recent layoffs at tech companies and my firsthand experiences with this challenging aspect of running a business.📢 I also share some communication strategies for staying connected with your team during challenging times and recommend resources to help managers succeed.📚  We then explore the nuances of managing different generations in the workplace, the keys to successful hiring, and reflect on the 'hire fast, fire faster' approach, considering its implications for your team.💡 Lastly, we discuss self-determination theory and how it might shape your management style.👉 Follow the link in the comments to watch the concluding part of the interview. As always, I hope you find it both enjoyable and insightful.🧩Click [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/D5610AQFjFdIPYYZh9Q/image-shrink_800/0/1680178801493?e=1684720800&v=beta&t=WPC1c4NG-tqOVbikd9sPgRRXYjzSXgWMMXiCRSNKfCo", "date": "April-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7047180717667074049", "number_of_likes": 45, "number_of_comments": 7}, {"content_of_the_post": "Buongiorno Linkedin!🎙️ Come join me for Episode 24 of Careers in the Cloud, where I have the pleasure of discussing my professional journey from Italy to Canada and sharing insights from my work experiences.🌍 We discuss how the industry can influence career longevity and examine the distinctions between a lifestyle business and an impact business. Understanding these differences can be valuable when charting your professional course.💡 I also share the spark that inspired me to create free management content, which led me to start posting on LinkedIn every day for a whole year about 18 months ago.🤝 Finally we dive into the importance of networking and emphasize the need to find a networking approach that resonates with you.👉 Click the link in the comments to watch the interview. I hope you find it both enjoyable and informative.🧩Click [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/D5610AQE21c2r3QJ2Xg/image-shrink_800/0/1680092400849?e=1684720800&v=beta&t=yuhdAJ05xkuoPhFLTUqXD2oxJfMF3oW_gnus6QRFczM", "date": "April-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7046818318904676352", "number_of_likes": 35, "number_of_comments": 1}, {"content_of_the_post": "Hey Linkedin, I recently had the pleasure of joining Maurizio Gioffrè on his excellent podcast, Careers in the Cloud, for a great conversation about Business and Life. We covered everything from the challenges of immigrating to Canada, to the thrill of leaving a small business behind for the big leagues of a large corporation and even delved into self-determination theory. You won't want to miss this chat, so stay tuned.🧩", "content_media": "https://media.licdn.com/dms/image/D5622AQE0nytJpueuFw/feedshare-shrink_800/0/1680006983019?e=1686787200&v=beta&t=6JzHqxmDfC02idiXmbS0BnDRSH_PZzsapNJYnW9Ycls", "date": "April-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7046460011392225281", "number_of_likes": 68, "number_of_comments": 3}, {"content_of_the_post": "Enter the Rotary Cellphone by Justine Haupt.This retro-inspired device ditches touchscreens, menus, and apps. The “innovative” design fits in your pocket while still enabling users to make calls with ease.Unless the number you are calling has too many Zeroes and 9s 😜🧩", "content_media": "https://media.licdn.com/dms/image/D5610AQHoFg2d_hhmDw/image-shrink_800/0/1679843104142?e=1684720800&v=beta&t=5y8tmFx13vhgK8tzCh-UNI0f0B2jFmYSgfzvK1ig-Pw", "date": "April-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7045772691668144128", "number_of_likes": 31, "number_of_comments": 17}, {"content_of_the_post": "𝗔𝗿𝗲 𝘆𝗼𝘂 𝗚𝗿𝗼𝘄𝗶𝗻𝗴 𝗼𝗿 𝗧𝗵𝗿𝗶𝘃𝗶𝗻𝗴?When it comes to growth and thriving, both involve progress and the development of new abilities. A growing plant is getting larger and developing new leaves and branches, whereas a thriving plant is not only growing but is also healthy and producing fruit. The same is true for people: a growing person is developing new skills and experiences, while a thriving person is not only developing new skills but is also happy and successful.", "content_media": null, "date": "April-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7045217853867794432", "number_of_likes": 17, "number_of_comments": 1}, {"content_of_the_post": "Happy Spring Linkedin!Yesterday was the equinox, a special time of year when the day and night are of equal length. This is because the sun is directly above the Earth's equator, rather than north or south of it. Fun fact of the day: the word equinox comes from the Latin aequinoctium, which means equal night (aequus noctis). It occurs twice a year, around March 20th and September 23rd.🧩", "content_media": "https://media.licdn.com/dms/image/C5610AQEdo70WUxBNAg/image-shrink_800/0/1679400906953?e=1684720800&v=beta&t=xbUsyyTuFKbFoxDT_e8I-xvM73CqLTGKRDl1p9Z5bgk", "date": "April-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7043917970418388992", "number_of_likes": 18, "number_of_comments": 0}, {"content_of_the_post": "I learned that Payscale conducts a yearly study on the Gender Pay Gap, and below are the 2023 results 👇Like everyone else, I’ve heard about the gender pay gap many times in the media.I always assumed those figures referred to the “controlled” data (i.e. equal pay for equal work). It turns out they were the “uncontrolled” data (i.e. average pay of all men vs of all women). Glad to see we are further ahead than I thought. Now let’s close that last 1%.🧩", "content_media": "https://media.licdn.com/dms/image/C5610AQFOha2LiriokA/image-shrink_800/0/1679314506839?e=1684720800&v=beta&t=DGOdc5zVPJG740PhMm35EKoDODOtgaqLO30vJ7r6FJ8", "date": "April-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7043555592551989248", "number_of_likes": 12, "number_of_comments": 5}, {"content_of_the_post": "Spotted in downtown Toronto, this somewhat dystopian AI-powered machine. If you show your item to the camera, it will recognize it and tell you which recycling bin to use. 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQHlae1qj-cMaA/feedshare-shrink_800/0/1679148351601?e=1686787200&v=beta&t=uOHIS-5gU6C2Q-v6L29g1dL9mZQKiS3bWg3X94Tuq7Y", "date": "March-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7042858651417542657", "number_of_likes": 27, "number_of_comments": 7}, {"content_of_the_post": "OpenAI's 𝗚𝗣𝗧-𝟯, or Generative Pre-trained Transformer 3, has caught the world's attention for its ability to produce text closely resembling human speech. 👉 Their next iteration in the GPT series, 𝗚𝗣𝗧-𝟰 is launching next week!GPT-4 is estimated to have been trained with over 100 trillion parameters, which is significantly more than GPT-3's 175 billion parameters. 🤯 These numbers take time to comprehend. If we convert them into time units:• 175 billion seconds is about 5,500 years. That's about the number years elapsed from the construction of the Pyramids to today • 100 trillion seconds is 3,170,979 years or about 𝟲𝟯𝟬 𝘁𝗶𝗺𝗲𝘀 the years elapsed from the construction of the Pyramids 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQEz8WKkYbYkLA/feedshare-shrink_800/0/1678568072363?e=1686787200&v=beta&t=4YiO7SCtZykZdTzTyvtWKJBri9q4xw1A9r9P_vJe8Mg", "date": "March-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7040424786514087936", "number_of_likes": 13, "number_of_comments": 2}, {"content_of_the_post": "I was listening to a serial entrepreneur who said he stopped labelling things as Good or Bad because if he fails, it means he is about to learn something new.• Failure leads to Learning.• Learning leads to Success.• Success leads to Complacency.• Complacency leads to Failure.The cycle is inevitable. His message: Recognize where you are and try to overcome Complacency as quickly as possible.🧩#EntrepreneurshipClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQFdbFJ0vvfxeg/feedshare-shrink_800/0/1674825604067?e=1686787200&v=beta&t=r7tD-p4563PEUbCwq6a_qkLEATfIJGfa_yrEyU4UjJA", "date": "February-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7024727764050079744", "number_of_likes": 21, "number_of_comments": 5}, {"content_of_the_post": "Companies must have a strong and talented workforce to thrive (and survive) in today's highly competitive business landscape. While certain unicorn organizations may have unique capabilities that set them apart, the vast majority 𝗵𝗮𝘃𝗲 𝗮𝗰𝗰𝗲𝘀𝘀 𝘁𝗼 𝘁𝗵𝗲 𝘀𝗮𝗺𝗲 tools, technologies, best practices, consulting firms, strategies, markets, research, and datasets.Therefore, companies (and managers) need to excel in talent acquisition and retention to succeed and stay ahead of the competition. 🧩#HiringClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQEGKxU34qbzdA/feedshare-shrink_800/0/1674652808380?e=1686787200&v=beta&t=hvkZGwogRZrF30683-NoQ3oaci-lUUTErBUoiTRSk8c", "date": "February-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7024003006404722688", "number_of_likes": 17, "number_of_comments": 2}, {"content_of_the_post": "How to level up your hiring game 👇Increase your success rate by:• Brushing up on psychology• Taking every chance you get to bring on new talent• Finding ingenious ways to automate the background tasks• Being clear about what kind of team member you need for each roleThen, fine-tune your technique by regularly putting yourself in a decision-making situation and seeking constructive criticism from reliable sources. Revamp your process from time to time with fresh experiments, get the data to back you up, and repeat the cycle.🧩#HiringClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQHU3D0MBFa9WQ/feedshare-shrink_800/0/1674566409063?e=1686787200&v=beta&t=CmVbDxgqtv58vldtef93B6dXryTBUBMAmBntRWrNgDA", "date": "February-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7023640630048284672", "number_of_likes": 6, "number_of_comments": 2}, {"content_of_the_post": "Are you ready to find the perfect fit for your team or organization? Then let's dive into how we assess candidates.At the core of our evaluation process are three key components: the Head, the Heart, and the Briefcase. 🧠 The 𝗛𝗲𝗮𝗱 represents a person's natural thought processes and decision-making style (aka their drivers). ❤️ The 𝗛𝗲𝗮𝗿𝘁 represents their values and alignment with the culture and vision of the team or organization. 💼 The 𝗕𝗿𝗶𝗲𝗳𝗰𝗮𝘀𝗲 represents their knowledge and experience, including the technical skills and relevant expertise needed for the role.The 𝗸𝗲𝘆 𝘁𝗼 𝘀𝘂𝗰𝗰𝗲𝘀𝘀𝗳𝘂𝗹 𝗵𝗶𝗿𝗶𝗻𝗴 is finding a candidate who excels in all three areas. And to help us do that, we use a variety of tools and techniques to assess each aspect.🧠 𝗙𝗼𝗿 𝘁𝗵𝗲 𝗛𝗲𝗮𝗱 (𝘁𝗵𝗲 𝗗𝗿𝗶𝘃𝗲𝗿𝘀), we rely on a behavioural survey and a 1:1 phone screen to get a sense of how a candidate's brain naturally responds to the world.❤️ 𝗙𝗼𝗿 𝘁𝗵𝗲 𝗛𝗲𝗮𝗿𝘁 (𝘁𝗵𝗲 𝗩𝗮𝗹𝘂𝗲𝘀), we use the phone screen and panel interview to gauge a candidate's alignment with our team's culture and vision.💼 𝗔𝗻𝗱 𝗳𝗼𝗿 𝘁𝗵𝗲 𝗕𝗿𝗶𝗲𝗳𝗰𝗮𝘀𝗲 (𝘁𝗵𝗲 𝗦𝗸𝗶𝗹𝗹𝘀), we turn to the panel interview and past samples of relevant work to assess a candidate's technical skills and expertise.It's important to note that none of these tools is perfect, and they should be considered holistically as part of the evaluation process. By looking at all the data points together, we can hopefully get a 𝗰𝗼𝗻𝘀𝗶𝘀𝘁𝗲𝗻𝘁 𝗽𝗶𝗰𝘁𝘂𝗿𝗲 of the candidate and determine if they are the right fit for the role.To learn more, get the 𝗳𝗿𝗲𝗲 Hiring Manager's Playbook here: 👉 http://bit.ly/3WI1xMc𝗮𝗻𝗱 𝗮𝗽𝗽𝗹𝘆 𝗰𝗼𝗱𝗲  Linkedin100  𝗮𝘁 𝗰𝗵𝗲𝗰𝗸𝗼𝘂𝘁 𝗳𝗼𝗿 𝗮 𝟭𝟬𝟬% 𝗱𝗶𝘀𝗰𝗼𝘂𝗻𝘁.🧩#HiringClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQHpsOfBf5CIWA/feedshare-shrink_800/0/1674480005639?e=1686787200&v=beta&t=zNAT9VRBGnBbGf5WJt1LdT18jNLjQ01aYezyjwRe6TU", "date": "February-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7023278224495308802", "number_of_likes": 25, "number_of_comments": 3}, {"content_of_the_post": "I’ve started to follow more art and architecture accounts to include some “beauty” in my social media diet. This picture appeared in my feed recently and stopped me in my tracks. These are the four main structures in Piazza del Duomo (Cathedral Square) in Florence 🇮🇹1️⃣ The Cathedral of Santa Maria del Fiore2️⃣ The Baptistery of St. John3️⃣ The Brunelleschi's Dome4️⃣ The (Giotto’s) Bell TowerThe Cathedral was built over ~140 years (1296 to approx 1436) 🤯I thought I’d share a little bit of beauty with my LinkedIn friends too. Happy Sunday!🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQEuG3MlYyxXkg/feedshare-shrink_800/0/1674393607816?e=1686787200&v=beta&t=gqyd37cBx0VjbpcVLi9N1lbL1hUEem4JDhBlL-azr2U", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7022915840790450176", "number_of_likes": 38, "number_of_comments": 5}, {"content_of_the_post": "I like this quote.It captures the idea that true authenticity and fulfillment can be found when we approach our work with a balance of intensity and playfulness, much like a child.It reminds me of some of my most cherished professional memories. These were projects that were all-consuming but also incredibly fulfilling. Despite the long hours, they didn't feel like work. They felt like serious play with friends instead.These projects had a unique blend of hard work and laughter, constant collaboration and individual contribution, and a balance of carefully crafted master plans and unexpected emerging strategies. We focused on achieving serious business outcomes yet remained playful and lighthearted.Cheers to those projects (and friends), and to many more!🧩#QuotesClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQHi8HGcrborIQ/feedshare-shrink_800/0/1674307206081?e=1686787200&v=beta&t=V4OKy1FmFFk7_MEkL4ChrUr9EyfXZXSJ0rm81PADwGk", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7022553445463195649", "number_of_likes": 12, "number_of_comments": 2}, {"content_of_the_post": "This tweet made me chuckle 🙂I haven’t used the first two yet, but I definitely have explained it is “Product”, not “Project”, a few times 🧩#ProductManagement", "content_media": "https://media.licdn.com/dms/image/C5622AQHxMgbSWpbhRw/feedshare-shrink_800/0/1674220806443?e=1686787200&v=beta&t=4T9Xd4oABrFREqtaFWJjxh5ANDQvAGH7a8Hcu2CDCZ0", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7022191056377049088", "number_of_likes": 11, "number_of_comments": 2}, {"content_of_the_post": "One of the best things I did to improve my hiring process was to reduce the phone interview duration by half 💡In order to generate remarkable results in my hiring approach, I've made some minor but impactful adjustments. 1️⃣ Firstly, I've significantly shortened phone interviews from a half hour to just 15 minutes. This saves the interviewer (me) and the candidate time and ensures that the conversation stays focused on the most critical information.2️⃣ Furthermore, before beginning any interviews, I've taken the time to identify a specific behavioural profile I'm looking for in a candidate based on the job description (e.g. Predictive Index)This helps me understand what qualities will be most valuable for the role and allows me to choose in advance a set of behavioural questions that will be most informative. This saves time and also helps to reduce bias.3️⃣ Another change I made was creating email templates for the most common messages I sent during the hiring process (e.g. Beeftext)This saves me a lot of time, increases efficiency and definitely improves my own overall experience.4️⃣ Lastly, I've automated the scheduling process of coffee chats, phone interviews, panel interviews, and reference checking (e.g. Calendly).This streamlines the hiring process, makes it much easier for everyone involved and allows me to focus on the most crucial part: evaluating the candidates themselves.👉 I've saved time, reduced bias, and improved the candidate experience by making these adjustments to my hiring process. If you want to improve yours, consider adopting similar strategies. 🧩#ManagementClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQG5KeB10JOMAQ/feedshare-shrink_800/0/1674134405977?e=1686787200&v=beta&t=vXYGV8WxaIuxEN8eCsYKKUyMK7XkxJGEHDh-q05J5WY", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7021828679198543872", "number_of_likes": 25, "number_of_comments": 1}, {"content_of_the_post": "Why not me?Yesterday I was fortunate enough to attend a session with Dave McKay, the CEO of the Royal Bank of Canada. One of the questions was about how he got to that prestigious position. He said he always had a voice inside asking, “Why not me?” He invited his RBC team to ask themselves the same question every time a new opportunity presents itself. Asking myself that question made me think about the self imposed barriers and limiting beliefs we create for ourselves. Insightful. 🧩Click [+ Follow] for more", "content_media": null, "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7021468800789221376", "number_of_likes": 36, "number_of_comments": 0}, {"content_of_the_post": "Tom Peters is a well-known management expert and author whose book In Search of Excellence has been a seminal text in business management for many years. He is known for his insightful, forthright, and contrarian approach to management. He has significantly influenced my career, shaping my perspectives on leadership and organizational excellence.I have had the privilege of attending two of his keynote presentations live at the World Economic Forum in Milan in 2004 and 2006.One of his latest messages is that every team should have a 𝗺𝘂𝘀𝗶𝗰 𝗼𝗿 𝘁𝗵𝗲𝗮𝘁𝗿𝗲 𝗺𝗮𝗷𝗼𝗿 aboard. I guess he reasons these individuals bring unique skills and perspectives to a team, such as creativity, problem-solving, and the ability to think on their feet. And that these skills are essential for any organization looking to stay ahead of the curve and innovate in a rapidly-changing world.Do you agree?🧩#ManagementClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQEGvmkvvpbjkg/feedshare-shrink_800/0/1673961607141?e=1686787200&v=beta&t=OOWva8JDMBO0c5qNHaMc3IL318bvLECiRmKwLSXjzxc", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7021103900107685888", "number_of_likes": 13, "number_of_comments": 0}, {"content_of_the_post": "I've interviewed tons of candidates in my time as a manager.Based on what I've seen, the best ones always have these five things in common 👇• They're seriously skilled but stay humble • They come prepared but aren't all scripted out • They're articulate but not stuck-up • They get to the point but also give all the details • They're confident but open to feedbackWhat about your top candidates? What qualities do they share?🧩#HiringClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQHsoF2eFbvXFQ/feedshare-shrink_800/0/1673875204989?e=1686787200&v=beta&t=xk-oIk6F-Pxf27x15TiYJrrWYnjvO2Cl4yMxe7OlfZA", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7020741507200548865", "number_of_likes": 22, "number_of_comments": 5}, {"content_of_the_post": "OpenAI's 𝗚𝗣𝗧-𝟯, or Generative Pre-trained Transformer 3, has caught the world's attention for its ability to produce text closely resembling human speech. Their next iteration in the GPT series, 𝗚𝗣𝗧-𝟰 boasts an impressive increase in size compared to its current version. Specifically, GPT-4 is estimated to have been trained with over 100 trillion parameters, which is significantly more than GPT-3's 175 billion parameters. 🤯 These numbers take time to comprehend. If we convert them into time units:• 175 billion seconds is about 5,500 years. That's about the number years elapsed from the construction of the Pyramids to today • 100 trillion seconds is 3,170,979 years or about 𝟲𝟯𝟬 𝘁𝗶𝗺𝗲𝘀 the years elapsed from the construction of the Pyramids As a result, it will be even better at language production and translation tasks by processing and retaining more information and nuances in language. Unlike GPT-3, GPT-4 is not publicly available at the moment and is only accessible to a select group of academics and developers.🧩#AIClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQGbRHSTDODt-w/feedshare-shrink_800/0/1673788806764?e=1686787200&v=beta&t=El4gt9w0iCam0GSRhTKp6E1Mw2_kymIjvk_QaoI6RuQ", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7020379140021264384", "number_of_likes": 18, "number_of_comments": 0}, {"content_of_the_post": "Hey LinkedIn, how many of you peuvent lire ça?🧩#FunnyClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQFFoXMBjVJIIA/feedshare-shrink_800/0/1673702402381?e=1686787200&v=beta&t=Lvpju3INdVwA9HJP809UinTzuzIxgqcj9duVoLlGZQ8", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7020016705414320128", "number_of_likes": 31, "number_of_comments": 11}, {"content_of_the_post": "Correction: In a previous version of this post, I incorrectly stated that the terms 'bull' and 'bear' in relation to the stock market originated from the movements of the animals themselves (i.e. bulls attack by swiping up, bears by swiping down). This is not the case. The terms originated from a proverb warning against selling the bear's skin before you have caught it. The term 'bear' was first used in the 18th century to refer to speculators selling stock they didn't own, expecting prices to drop. This practice was prevalent in the South Sea bubble scandal of 1720, which brought the term into widespread use. The term 'bull' was later coined to refer to those who bought securities or commodities expecting a price rise. The more you know.🧩#MarketsClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQE465C3eQHBEg/feedshare-shrink_800/0/1673616005488?e=1686787200&v=beta&t=JOXYRVn5mvszgRlUI2rNgR_hjYoX_LAYnaN3RQYu6So", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7019654334992846848", "number_of_likes": 18, "number_of_comments": 3}, {"content_of_the_post": "Have you heard of the 𝗕𝗮𝗯𝗯𝗹𝗲 𝗘𝗳𝗳𝗲𝗰𝘁? It's the large, positive correlation between speaking time and leader emergence.This phenomenon is quite well established.Some people are almost offended when they hear about it.𝗠𝘆 𝘂𝗻𝗽𝗼𝗽𝘂𝗹𝗮𝗿 𝗼𝗽𝗶𝗻𝗶𝗼𝗻 👇The solution is not to stop rewarding people who dominate the conversation. Whether you think it's right or wrong, it doesn't change the fact that WE clearly do reward people that speak more, according to the data. Good leaders may change how they facilitate team discussions, but this is not a long-term solution.Rather than rely on the chance of a good leader / facilitator, wouldn't a better strategy be for 𝗖𝗼𝗺𝗽𝗲𝘁𝗲𝗻𝘁 𝗜𝗻𝘁𝗿𝗼𝘃𝗲𝗿𝘁𝘀 𝘁𝗼 𝘀𝗽𝗲𝗮𝗸 𝘂𝗽 𝗺𝗼𝗿𝗲?Speaking up is an action 𝘄𝗶𝘁𝗵𝗶𝗻 𝗼𝘂𝗿 𝗰𝗼𝗻𝘁𝗿𝗼𝗹. On the other hand, having a thoughtful facilitator at the meeting is an external factor outside of our control.🧩#CareersClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQH7WXYVmW01lw/feedshare-shrink_800/0/1673529603451?e=1686787200&v=beta&t=pg9w2z0hdyIYmDnXrFVP6D4celmjOoEymDmKWEPCZHk", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7019291968484626433", "number_of_likes": 9, "number_of_comments": 1}, {"content_of_the_post": "People-leaders, do you know what 𝗦𝗲𝗹𝗳-𝗗𝗲𝘁𝗲𝗿𝗺𝗶𝗻𝗮𝘁𝗶𝗼𝗻 𝗧𝗵𝗲𝗼𝗿𝘆 is? It's a theory of human motivation and personality that concerns people's innate growth tendencies and psychological needs. The central thesis is that three fundamental and universal psychological needs—𝗔𝘂𝘁𝗼𝗻𝗼𝗺𝘆, 𝗖𝗼𝗺𝗽𝗲𝘁𝗲𝗻𝗰𝗲, 𝗮𝗻𝗱 𝗕𝗲𝗹𝗼𝗻𝗴𝗶𝗻𝗴—drive human behaviour and that fulfilling these needs directly affects an individual's well-being.I recently got the opportunity to discuss my former management experience, and I referred to this notion, which has served as one of my 𝗴𝘂𝗶𝗱𝗶𝗻𝗴 𝗽𝗿𝗶𝗻𝗰𝗶𝗽𝗹𝗲𝘀 𝗳𝗼𝗿 𝗺𝗮𝗻𝗮𝗴𝗶𝗻𝗴 𝗽𝗲𝗼𝗽𝗹𝗲 since I first learnt about it a few years ago.👉 Watch this great 𝟵𝟬 𝘀𝗲𝗰𝗼𝗻𝗱𝘀 𝘀𝘂𝗺𝗺𝗮𝗿𝘆 to learn more: http://bit.ly/3isYdFU 🧩#ManagementClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQE6aSkdQUZdCQ/feedshare-shrink_800/0/1673443207398?e=1686787200&v=beta&t=BEiSnFRBi64zS6uWfkab2vtneqteADFVsGzRdoXxfHI", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7018929573153173504", "number_of_likes": 12, "number_of_comments": 2}, {"content_of_the_post": "When I was hiring for my team, finding a good time for phone interviews with all the candidates was a total drag. But then I discovered Calendly, and it was a game-changer. Setting it up took a bit of time, but once it was good to go, I just sent the link to the candidates and let them pick a time that worked for them. No more annoying back-and-forth trying to coordinate schedules. If you are hiring - or want to avoid dealing with the headache of coordinating times through email in general - Calendly is the way to go.🧩#HiringTipsClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQEHnodnmp_nvg/feedshare-shrink_800/0/1673356805014?e=1686787200&v=beta&t=IVLwCuVozZZrILEZZJ2XZOngkhC6HUupiUw2rJSy80Y", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7018567184297721857", "number_of_likes": 15, "number_of_comments": 10}, {"content_of_the_post": "𝗔𝗿𝗲 𝘆𝗼𝘂 𝗹𝗼𝗼𝗸𝗶𝗻𝗴 𝗳𝗼𝗿 𝗮 𝘄𝗮𝘆 𝘁𝗼 𝘄𝗼𝗿𝗸 𝗲𝗳𝗳𝗲𝗰𝘁𝗶𝘃𝗲𝗹𝘆 𝘄𝗶𝘁𝗵 𝗼𝘁𝗵𝗲𝗿𝘀? If so, consider learning about the DISC personality framework.The DISC framework is often used in business and management settings to improve team members' communication, collaboration, and understanding. It was developed in the 1920s by Harvard psychologist William Moulton Marston. He proposed that there are four primary character types, each characterized by a set of distinct behavioural traits (although individuals will exhibit attributes from multiple traits): • Dominance (D)• Influence (I)• Steadiness (S)• Conscientiousness (C)The psychology field has evolved tremendously in the past 100 years, and today there are much more accurate behavioural tests (e.g. Big Five).That said, the DISC framework can still be a helpful introduction for those looking to learn more about 𝗱𝗶𝗳𝗳𝗲𝗿𝗲𝗻𝘁 𝗰𝗼𝗺𝗺𝘂𝗻𝗶𝗰𝗮𝘁𝗶𝗼𝗻 𝘀𝘁𝘆𝗹𝗲𝘀 and how to interact effectively with others.When I first encountered DISC in 2016, I spent some time compiling all the information I could find on the different traits into 𝗮 𝘀𝗶𝗻𝗴𝗹𝗲 𝗱𝗼𝗰𝘂𝗺𝗲𝗻𝘁.👉 I found it helpful at the time, so 𝗜'𝗺 𝗻𝗼𝘄 𝘀𝗵𝗮𝗿𝗶𝗻𝗴 𝘁𝗵𝗶𝘀 𝗰𝗵𝗲𝗮𝘁 𝘀𝗵𝗲𝗲𝘁 𝘄𝗶𝘁𝗵 𝘆𝗼𝘂. You can download it from here: http://bit.ly/3WYR8vSHave you ever used the DISC personality framework to understand your own behaviour or the behaviour of others? What was your experience with it?🧩⁠ ⁠ #ManagementClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQEzke3seMJy0g/feedshare-shrink_800/0/1673270407291?e=1686787200&v=beta&t=PZ2dnVQrcoEC05hPwkdHkVmuieyHuz2qQuiN4vLYEaY", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7018204792648851457", "number_of_likes": 11, "number_of_comments": 3}, {"content_of_the_post": "During a career chat with a team member a while back, we talked about exploring new opportunities and domains. I gave my thoughts and used my analytical skills to weigh their options.But then I remembered this quote from Sigmund Freud: In small matters trust the mind, in large ones the heart. If a new adventure feels right in your gut, go for it even if it's not the best choice on paper. That energy is necessary to deliver your best work. Embrace it and let it drive you forward.🧩#CareersClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQE4QxF_us2FhA/feedshare-shrink_800/0/1673184002994?e=1686787200&v=beta&t=PGvInjWozzaSe622eatkyg9eDRKxokQ1RHvYOGN7rqE", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7017842412609835008", "number_of_likes": 19, "number_of_comments": 2}, {"content_of_the_post": "Did you know the University of Bologna 🇮🇹 was over 200 years old when the Aztec Empire was funded? Me neither 🤯Funded in ~1190 vs 1428, respectively. Google it. 🧩#FabiosFunFactsClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQHb3G2HYHokaw/feedshare-shrink_800/0/1673097721954?e=1686787200&v=beta&t=DAw4_Dyvc-mHs0Y3J-u21Kj930e-DTOB0cyn1nyXRkQ", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7017480501758214144", "number_of_likes": 10, "number_of_comments": 0}, {"content_of_the_post": "Artificial Intelligence has a sense of humour 😮I jokingly asked ChatGPT to give me “the most ironic, satirical advice you can about using a structured interview process to select the best candidates”Here is the full reply 👇If you really want to find the best candidates for your open positions, forget about using a structured interview process. I mean, why waste time and effort asking consistent questions, evaluating skills and fit with company culture, and gathering references when you can just go with your gut?After all, your instincts are always right, right? You know what you like, and if you feel a spark of chemistry with a candidate, then they must be the one. And if they don't have the exact skills and experience that you're looking for, no problem! You can just train them on the job.So go ahead and ditch the structured interview process. Trust your gut, and hire the first candidate that you feel a connection with. I mean, what could go wrong?🧩#ArtificialIntelligenceClick [+ Follow] for more ", "content_media": "https://media.licdn.com/dms/image/C5622AQFsucfuTKfMVw/feedshare-shrink_800/0/1673011202178?e=1686787200&v=beta&t=159a1uVnb8rliB6VnzbBDUdIPtGP9igRA00-jHEjt_Y", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7017117626069917696", "number_of_likes": 15, "number_of_comments": 2}, {"content_of_the_post": "Improve your yearly performance review process with this easy-to-use assessment spreadsheet 👇Hey people leaders, it's time for performance reviews! Are you ready? ⁠⁠I've developed some tools over the years to make this task easier. ⁠⁠One of them is an assessment spreadsheet. Here's a quick rundown:⁠⁠First, I create a spreadsheet with dimensions to rate performance (e.g. decision-making, communication, relationships) in the first column. ⁠⁠Then, list team members' names in the other columns and assign values using a 5-point Likert scale. ⁠⁠This helps me more clearly articulate my thoughts on each individual's performance.⁠⁠👉 I find it helpful, so I'm sharing it with you. You can download it from here: http://bit.ly/3WC1x09 ⁠⁠Do you have any tips for assessing performance? ⁠⁠I'd love to hear how others tackle this critical task!!⁠🧩⁠⁠#ManagementTips⁠⁠Click [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQFc0R3-mQfbAw/feedshare-shrink_800/0/1672924803653?e=1686787200&v=beta&t=-RyXQ5PaPURdtXCAgWWVw5JM3w-ewHrEASPrlKLNcYM", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7016755233787711488", "number_of_likes": 12, "number_of_comments": 1}, {"content_of_the_post": "As we reflect on 2022, we need to acknowledge some historical milestones that we have reached. The population of the Earth has reached a staggering 𝟴 𝗯𝗶𝗹𝗹𝗶𝗼𝗻, and the global economy has surpassed $𝟭𝟬𝟬 𝘁𝗿𝗶𝗹𝗹𝗶𝗼𝗻.The International Monetary Fund estimates the current state of the world economy at $101.6 trillion, with the #UnitedStates accounting for 𝗼𝗻𝗲 𝗾𝘂𝗮𝗿𝘁𝗲𝗿 𝗼𝗳 𝘁𝗵𝗮𝘁 𝗳𝗶𝗴𝘂𝗿𝗲. China and Japan follow in second and third place, with Canada rising to eighth place and Italy claiming the tenth spot.𝗛𝗼𝘄𝗲𝘃𝗲𝗿, 𝘁𝗵𝗲𝘀𝗲 𝘀𝘁𝗮𝘁𝗶𝘀𝘁𝗶𝗰𝘀 𝗱𝗼 𝗻𝗼𝘁 𝗽𝗮𝗶𝗻𝘁 𝘁𝗵𝗲 𝘄𝗵𝗼𝗹𝗲 𝗽𝗶𝗰𝘁𝘂𝗿𝗲.They do not consider factors such as 𝗽𝗼𝗽𝘂𝗹𝗮𝘁𝗶𝗼𝗻 𝘀𝗶𝘇𝗲 (i.e. GDP per Capita), in which case #Europe claims the top spots, with Luxembourg, Ireland, and Norway leading the way. The United States falls to seventh place, Canada to eleventh, and Italy to thirty-first.Additionally, these figures do not consider the 𝗽𝘂𝗿𝗰𝗵𝗮𝘀𝗶𝗻𝗴 𝗽𝗼𝘄𝗲𝗿 of a country's currency or what can you buy for $1? Using this measure, #China comes out on top, followed by the United States and #India. Italy and Canada trail behind in twelfth and fifteenth place, respectively.👉 It is clear that the World is a complex place, and to truly understand it, we must be willing to consider multiple perspectives.🧩#EconomyClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQHTDA62ggjwog/feedshare-shrink_800/0/1672838405793?e=1686787200&v=beta&t=ZlX4yOuRI3Q5UJYlFy9QqEqrerxjt8iL4tYbzWRZljU", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7016392874606944256", "number_of_likes": 18, "number_of_comments": 2}, {"content_of_the_post": "Do you make resolutions for the new year? I used to, but then stopped. I'm still not sure what I think about them.This list, though, got me thinking about what each of these resolutions means to me:To have an 𝗲𝗻𝘁𝗿𝗲𝗽𝗿𝗲𝗻𝗲𝘂𝗿'𝘀 𝗺𝗶𝗻𝗱 means taking responsibility for everything that occurs. Thinking in terms of maybe and and instead of no and either/or. Prioritizing execution over strategy. Constantly learning.Having an 𝗮𝘁𝗵𝗹𝗲𝘁𝗲'𝘀 𝗯𝗼𝗱𝘆 involves eating healthily and exercising on a daily basis. Going to bed by early and sleeping 8 hours a night. Stretching and meditating. Fasting and experiencing cold exposure.Having an 𝗮𝗿𝘁𝗶𝘀𝘁'𝘀 𝘀𝗼𝘂𝗹 means being open to experiences and finding opportunities to use your creativity. Trusting your instincts, even if you can't accurately describe what you're doing. Being authentic.What do they mean to you?🧩#FoodForThoughtsClick [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQHLi3iYcSAOtg/feedshare-shrink_800/0/1672752008212?e=1686787200&v=beta&t=KVq2fJFuJLk6H6eVrs-NNU6K0MulrUr-ab5e1x7cAzM", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7016030468143796224", "number_of_likes": 17, "number_of_comments": 6}, {"content_of_the_post": "The 𝗙𝗿𝗲𝘀𝗵 𝗦𝘁𝗮𝗿𝘁 𝗲𝗳𝗳𝗲𝗰𝘁 is a phenomenon that occurs when people are more likely to take action towards a goal after a special occasion or key date has passed. Examples of this include New Year's Day, the first day of the month, or even a Monday. These points in time can act as mental triggers for us to begin something new. 👉 Recently, I came across the idea that by dividing the day into multiple segments, 𝘀𝘂𝗰𝗵 𝗮𝘀 𝗺𝗼𝗿𝗻𝗶𝗻𝗴, 𝗮𝗳𝘁𝗲𝗿𝗻𝗼𝗼𝗻, 𝗮𝗻𝗱 𝗲𝘃𝗲𝗻𝗶𝗻𝗴, we can create more opportunities for fresh starts. This means that if you miss the chance to do something, the next trigger is just a few hours away. For instance, if you have a challenging morning, it doesn't have to ruin the entire day, and you can start anew in the afternoon. How have you leveraged the Fresh Start effect?🧩#LifeProTips Click [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQGU24AHr4MyhQ/feedshare-shrink_800/0/1672665604060?e=1686787200&v=beta&t=16_FvoacEdcBIrQ1KdUBkbFtXlfYHUIr1ReJ1a5bUf8", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7015668061710032896", "number_of_likes": 16, "number_of_comments": 2}, {"content_of_the_post": "Happy New Year, Linkedin! 🎉I hope this year brings you joy, prosperity, and good health. And the chance to work hard at something worth doing.Here's to a fantastic year ahead!I look forward to meeting more of you in person (or virtually). 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQGRkTgvGiC1pw/feedshare-shrink_800/0/1672579204140?e=1686787200&v=beta&t=1hCBMoEI-PTE8VKifEVj8HQsdZOHg64LibaxY1IMyg8", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7015305685387141120", "number_of_likes": 15, "number_of_comments": 8}, {"content_of_the_post": "To the 400 thousand people who saw my posts, left comments, liked, shared and engaged with me in 2022, thank you!Some of you I’ve met in person, others via video chat. Or we just exchanged messages. Others, I haven’t met you yet, but I’ve gotten to know you a bit through your content. Either way, it’s been a year full of new connections, lessons learned, and lessons shared. Cheers to 2023! 🥂🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQE5xTAl-V7XZA/feedshare-shrink_800/0/1672507205129?e=1686787200&v=beta&t=oNqXEm57QBNewWaO1eI-ZCQm48rT7LkXaOQl0QuXvvo", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7015003693984997376", "number_of_likes": 17, "number_of_comments": 2}, {"content_of_the_post": "Are any parents out there showing their kids a pre-recorded countdown video tonight so that the kids can go to bed early? And then, actually going to bed with them? 💡", "content_media": "https://media.licdn.com/dms/image/C5622AQEycAEzJuw9gg/feedshare-shrink_800/0/1672492803644?e=1686787200&v=beta&t=caPFo55yafXLsZMGayz8aX7I-xrvE4RvlVTYHpHnK4Y", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7014943296728825856", "number_of_likes": 7, "number_of_comments": 2}, {"content_of_the_post": "I made this calendar template a while back to help me plan vacations and see the work weeks clearly. One thing I love about it is that all 365 days fit on the screen, making it easy to see the best way to use vacation days.If you know me at all, you know I like when information is easily understandable at a glance.This file already includes most Canadian holidays, but you can modify it to add or remove holidays based on your company or country.I find it helpful, so I'm sharing it with you. You can download it from here: bit.ly/3i6AgE6 Have a great 2023!🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQFho4_UT4CRew/feedshare-shrink_800/0/1672406404619?e=1686787200&v=beta&t=sytqQfrF4BZt2R9_wJoRADyWzfwzy78VM5nRA54GZZc", "date": "January-2023", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7014580929486610432", "number_of_likes": 40, "number_of_comments": 6}, {"content_of_the_post": "From our family to yours, Merry Christmas to those of you celebrating today and Happy Holidays to all! 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQHvNq7wSUXfIQ/feedshare-shrink_800/0/1671985846812?e=1686787200&v=beta&t=0erZXedoeKMhK2Iu6z02hh0U_5EfZkRriJS26qhAZ3c", "date": "December-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7012816931980263424", "number_of_likes": 88, "number_of_comments": 12}, {"content_of_the_post": "Did you know that today is the (winter) solstice? This means that starting tomorrow, the days will be getting longer for those of us in the northern hemisphere! 👌Fun fact: the word solstice comes from the Latin words sol (sun) and sistere (to stand still). This is because at the solstices, the Sun's movement seems to stand still before changing direction. 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQEahL8IUdvj3Q/feedshare-shrink_800/0/1671628804308?e=1686787200&v=beta&t=RlxLf_t-787tGBOnV1BWZYV7JYLR2B2ZgqkVvuYACK8", "date": "December-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7011319414033694720", "number_of_likes": 29, "number_of_comments": 6}, {"content_of_the_post": "The most populous places on Earth are revealed in this 3D Map created by Alasdair Rae. To my fellow Canadians, I'll add a link in the comments to a truly unique view which reveals Canada's vastnesses and how our population is distributed across the major cities.Check out his Twitter (@undertheraedar) for more stunning images.🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQEqEmpDdQtnGQ/feedshare-shrink_800/0/1670505614433?e=1686787200&v=beta&t=pMJOTUKwjaidnOuD2A0fGrw1VuBCAA4Y7qXYv8mab4o", "date": "December-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7006608437274951680", "number_of_likes": 23, "number_of_comments": 2}, {"content_of_the_post": "𝗔𝗿𝗲 𝘄𝗲 𝗚𝗿𝗼𝘄𝗶𝗻𝗴 𝗼𝗿 𝗮𝗿𝗲 𝘄𝗲 𝗧𝗵𝗿𝗶𝘃𝗶𝗻𝗴?The other day I was talking with a dear friend about the difference between the two terms. I couldn’t articulate it very well, so I looked it up. Growing and thriving are similar in that they both refer to the development of new abilities, the expansion of existing ones or some form of progress. However:A growing plant is getting bigger and developing new leaves and branches. Likewise, a 𝗴𝗿𝗼𝘄𝗶𝗻𝗴 𝗽𝗲𝗿𝘀𝗼𝗻 is developing new skills and experiences that help them become more capable and knowledgeable.Instead, a thriving plant is not just getting bigger but is also healthy and producing flowers or fruit. Likewise, a 𝗽𝗲𝗿𝘀𝗼𝗻 𝘁𝗵𝗿𝗶𝘃𝗶𝗻𝗴 is not just developing new skills but is also happy and successful.👉 In summary, growth refers to progress, expansion and development of new skills. Thriving, on the other hand, implies that something is not just growing but is also healthy and prosperous. As we consider the future of our career, company, or family, it is helpful to ask ourselves whether we are simply growing or if we are truly thriving. 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQEeXLkHoOpDCg/feedshare-shrink_800/0/1670419208722?e=1686787200&v=beta&t=sHzRUEbzBpQynY2Vukg41mculpwOvTkPSXArBGwX3Ng", "date": "December-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7006245996439502849", "number_of_likes": 17, "number_of_comments": 6}, {"content_of_the_post": "We have heard that AI will change everything, but most of us don't have access to any practical tool we could use daily. 𝗧𝗵𝗮𝘁 𝗰𝗵𝗮𝗻𝗴𝗲𝗱 𝗹𝗮𝘀𝘁 𝘄𝗲𝗲𝗸.Open AI launched ChatGPT, a game-changing natural language processing tool that generates responses to user inputs. ChatGPT mimics human conversation and provides relevant responses to various topics, and it has already surpassed 1 million users.I played around with it and found it's good not only at writing but also at idea generation, strategic thinking and teaching.Answers are not perfect, but they are rarely (if ever) below 𝟱 𝗼𝘂𝘁 𝗼𝗳 𝟭𝟬. This is scary good for a free tool in its infancy.Here are some of the prompts I played with:• Explain how to forecast inventory restocking time and quantity• Write a professional email to say nice meeting you let's stay in touch• Is life more like Poker or like Chess?• Describe blockchain technology to a 5 year old child• Name the top 3 skills to develop before AI takes overCheck it out at 𝗖𝗵𝗮𝘁 [.] 𝗢𝗽𝗲𝗻𝗔𝗜 [.] 𝗰𝗼𝗺  Do you think it is revolutionary or not?🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQGAfTH_M8va-Q/feedshare-shrink_800/0/1670332803400?e=1686787200&v=beta&t=IXS9Ah3gzWGFGpOdx_YzTteJy3V_rhOl5R7c5GSQvrg", "date": "December-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7005883601141596162", "number_of_likes": 22, "number_of_comments": 10}, {"content_of_the_post": "Here are 𝟭𝟬 𝘁𝗮𝗸𝗲𝗮𝘄𝗮𝘆𝘀 from Annie Duke’s excellent book Thinking in Bets: Making Smarter Decisions When You Don't Have All the Facts.1. Life is more like 𝗣𝗼𝗸𝗲𝗿 than Chess (chess is computation, while real-life also consists of luck and occasional deception)2. All decisions are bets, and we should think in 𝗽𝗿𝗼𝗯𝗮𝗯𝗶𝗹𝗶𝘀𝘁𝗶𝗰 terms (i.e. likelihood), not absolutist terms (i.e. true/false)3. 𝗢𝘂𝘁𝗰𝗼𝗺𝗲 𝗕𝗶𝗮𝘀 (aka Resulting) is our tendency to believe that a good outcome signifies a good decision. And a bad result is a sign of a wrong decision4. Instead, good decisions can generate adverse outcomes at times, and 𝘃𝗶𝗰𝗲-𝘃𝗲𝗿𝘀𝗮5. The goal is to improve the quality of decision-making because, over time, it will generate a higher 𝗹𝗶𝗸𝗲𝗹𝗶𝗵𝗼𝗼𝗱 of success6. Create a system to encourage and gather 𝗱𝗶𝘀𝘀𝗲𝗻𝘁𝗶𝗻𝗴 viewpoints instead of silencing them (e.g. red team)7. The way we feel about outcomes is 𝗽𝗮𝘁𝗵 𝗱𝗲𝗽𝗲𝗻𝗱𝗲𝗻𝘁 (e.g. win $1000 at the casino and then lose them vs lose $1000 and then win them back)8. Use the 𝟭𝟬-𝟭𝟬-𝟭𝟬 𝗿𝘂𝗹𝗲 to get perspective on decisions: ask how you'll feel in 10 minutes, 10 months, and 10 years9. Use 𝗕𝗮𝗰𝗸𝗰𝗮𝘀𝘁𝗶𝗻𝗴 (i.e. working backwards from a positive future) instead of Forecasting (i.e. making predictions based on past data)10. Host a 𝗣𝗿𝗲𝗺𝗼𝗿𝘁𝗲𝗺 i.e. Imagine we failed to achieve our goals. What went wrong, and how do we mitigate it?10/10 would recommend it.🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQE9GP6Q0LF6uw/feedshare-shrink_800/0/1670246402322?e=1686787200&v=beta&t=IR54rYJeS1jHxuykgwFy-P6pUnvHyLbJ7jy8tmjSNXc", "date": "December-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7005521198176493568", "number_of_likes": 16, "number_of_comments": 5}, {"content_of_the_post": "Happy Thanksgiving long weekend to my friends south of the border. Enjoy your holiday!🧩", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7001694239411642368", "number_of_likes": 3, "number_of_comments": 0}, {"content_of_the_post": "Last week the world population reached 8 Billion people! Growing up, I heard about the dangers of endless overpopulation.Instead, we'll peak at about 10.4 billion in 2086 before falling again.Here's how quickly the population grew:• It was in 1805 that the world reached its first billion; it then took another 120 years to reach two billion. • By the third billion, this period had reduced to 35 years, reduced further to 14 years to reach four billion. • The fastest growth occurred from 1974 to 2011, taking only 12 to 13 years to increase by one billion for the 5th, 6th, and 7th.• The world has now surpassed the peak growth rate, and the period between each billion will continue to rise. • It's estimated to take approximately 14 years to reach nine billion in 2037 and a further 21 years to reach 10 billion in 2058. 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQFrs7U2BpKa6g/feedshare-shrink_800/0/1669256706108?e=1686787200&v=beta&t=2tcOFGdfZBjz5vAYl34mddHI0JyCBFKQqtAa_NUPO3g", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7001370083260334080", "number_of_likes": 9, "number_of_comments": 2}, {"content_of_the_post": "𝗗𝗼𝗻'𝘁 𝘀𝗵𝗼𝗼𝘁 𝘁𝗵𝗲 𝗺𝗲𝘀𝘀𝗲𝗻𝗴𝗲𝗿!I used to think this was a warning about fairness, about not making the messenger pay for someone else's misconduct.I learned today it's about self-preservation instead 🤯While the phrase originates in the fog of history, one of its earlier documented use is by Plutarch when he writes about Tigranes, King of Armenia.When a messenger gave notice of a political enemy coming to see him, Tigranes had the messenger's head cut off. After that incident, no one dared bring any further negative information. Tigranes, while at war, had no enemy intelligence, ultimately resulting in several military defeats.👉 My takeaway, in a business setting: listen to dissenting views instead of silencing or ignoring them.🧩", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7001003469289529344", "number_of_likes": 8, "number_of_comments": 2}, {"content_of_the_post": "I'm reading a book about decision-making in Business and Life. The author is using Chess and Poker as two possible models.I'm curious, what does LinkedIn think?🧩", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7000625816707510272", "number_of_likes": 5, "number_of_comments": 10}, {"content_of_the_post": "Who neither knows victory nor defeat 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQESq04CBl471Q/feedshare-shrink_800/0/1668952857123?e=1686787200&v=beta&t=AS8Or6QY7Xsrlka0r8c_agUngz67ttdVFjY4VXJ08A8", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7000095650742767616", "number_of_likes": 13, "number_of_comments": 0}, {"content_of_the_post": "As a European, I can confirm it checks out 💯🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQH17XP_xYu7_A/feedshare-shrink_800/0/1668900778657?e=1686787200&v=beta&t=8FuGkpnWsySgFmh9Y-7-Dncr5oXZDEvWhluFM4GFXg4", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6999877214125125633", "number_of_likes": 6, "number_of_comments": 3}, {"content_of_the_post": "Requirements elicitation for software development is indeed both an Art and a Science 😜", "content_media": "https://media.licdn.com/dms/image/C5622AQGIa8N3B7Z6dg/feedshare-shrink_800/0/1668868506481?e=1686787200&v=beta&t=zJHb-MVpS2aKjQtkdTV6nVrGZrVe54hPMIX-gWmzis0", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6999741855642910720", "number_of_likes": 8, "number_of_comments": 1}, {"content_of_the_post": "Would you attend? Why or why not? 👇", "content_media": "https://media.licdn.com/dms/image/C5622AQG1hkfg7oK_FQ/feedshare-shrink_800/0/1668819220400?e=1686787200&v=beta&t=_Su2fnFMeMphf4rRhp6iWziFlKkeQVyYX_9YQfqt45Y", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6999535134328700929", "number_of_likes": 12, "number_of_comments": 4}, {"content_of_the_post": "As someone who likes Lean, systems, playbooks - and efficiency - this stopped me in my tracks.Did I completely miss the point? 𝘐𝘧 𝘸𝘦 𝘸𝘢𝘯𝘵 𝘴𝘰𝘮𝘦𝘵𝘩𝘪𝘯𝘨 𝘵𝘰 𝘦𝘯𝘥𝘶𝘳𝘦, 𝘸𝘦 𝘴𝘵𝘳𝘪𝘷𝘦 𝘧𝘰𝘳 𝘣𝘦𝘢𝘶𝘵𝘺, 𝘯𝘰𝘵 𝘧𝘰𝘳 𝘦𝘧𝘧𝘪𝘤𝘪𝘦𝘯𝘤𝘺.I suspect this applies beyond architecture and urban planning. It's an invitation to reflect on how I can introduce Beauty to my work. And in the other aspects of Life.🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQEEPkEQAldd6w/feedshare-shrink_800/0/1668777304946?e=1686787200&v=beta&t=PKi5KQFw598NmuIPTGsR2GnXkd0MaCmqYziifaAofG8", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6999359358149033984", "number_of_likes": 13, "number_of_comments": 3}, {"content_of_the_post": "So simple, yet so effective! Anyone could do the same to locate their organization's best teams/leaders.In what other scenario would it be clever to use this approach?🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQGIvOBJHrfSgg/feedshare-shrink_800/0/1668734108261?e=1686787200&v=beta&t=LlPfQhUmINjrKQggcG6oSjmyo-H9JIC_ZXkLrVwRefc", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6999178179051499521", "number_of_likes": 2, "number_of_comments": 0}, {"content_of_the_post": "Have you heard we live in a VUCA world?It means that Volatility, Uncertainty, Complexity and Ambiguity make it challenging to understand the present and predict the future.Change Management, therefore, is the arena where companies, departments and individuals battle the VUCA world. The Knoster model (below) is a framework for Change Management that shows how each “ingredient” contributes to the “recipe.”🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQGrCEsrYye3JQ/feedshare-shrink_800/0/1668690907164?e=1686787200&v=beta&t=L3cXdlj2sDkOYrAgspAfPX9qty6-XB9OZlyVYfKAuus", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6998997017985245184", "number_of_likes": 19, "number_of_comments": 6}, {"content_of_the_post": "I think the same is true for any team 👇", "content_media": "https://media.licdn.com/dms/image/C5622AQHc-QYoqZpZlg/feedshare-shrink_800/0/1668647705261?e=1686787200&v=beta&t=ajn7Kexyj1hcDJ248C4LvaLyyNQVA6N4VFiPXoaKy-0", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6998815779148222464", "number_of_likes": 4, "number_of_comments": 1}, {"content_of_the_post": "𝘍𝘪𝘹 𝘸𝘩𝘢𝘵 𝘣𝘰𝘵𝘩𝘦𝘳𝘴 𝘺𝘰𝘶, 𝘯𝘰 𝘮𝘢𝘵𝘵𝘦𝘳 𝘩𝘰𝘸 𝘴𝘮𝘢𝘭𝘭.I like this quote. It has stuck with me since when I found it years ago.What it made me realize is that:𝗜𝗳 𝘀𝗼𝗺𝗲𝘁𝗵𝗶𝗻𝗴 𝗯𝗼𝘁𝗵𝗲𝗿𝘀 𝘂𝘀, 𝗶𝘁'𝘀 𝗻𝗼𝘁 𝘁𝗿𝗶𝘃𝗶𝗮𝗹.Whatever it is, no matter how small, I try not to let it linger. Otherwise, it keeps taking my mental bandwidth. It occupies more of my cognitive real estate.And soon enough, there is less of me and more of these nuisances.Instead, when I fix the small things, I have more power and skills to improve the bigger things.What bothers you today?🧩", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6998634559915397120", "number_of_likes": 10, "number_of_comments": 4}, {"content_of_the_post": "I attended an insightful session about Design Thinking & Innovation led by Madeleine Baker today. We also went through a few exercises I can reuse with the product I support - such as User group definition, Empathy map, How Might We reframing.Here are the main takeaways for me:• Design Thinking is about disciplined engagement in the practice of Innovation• There are *many* ways to innovate (7 Modes, 10 Types)• Reframing the problem creates space for new ideas and solutionsVery timely and relevant in my new role.10/10 would recommend.🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQHkrLuLSg3gZA/feedshare-shrink_800/0/1668557323543?e=1686787200&v=beta&t=bKlzs8fEI4bOg8bKWrElKONVM2Ak7O7-IyS0-LaxjxA", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6998436659977478144", "number_of_likes": 10, "number_of_comments": 0}, {"content_of_the_post": "Is this your first time hiring someone, and you don’t know where to start? Are you worried about hiring the wrong person?👇Like you, I received zero training on conducting my first hiring round years ago. 𝗧𝗵𝗶𝘀 𝗽𝗹𝗮𝘆𝗯𝗼𝗼𝗸 𝗶𝘀 𝘁𝗵𝗲 𝗱𝗼𝗰𝘂𝗺𝗲𝗻𝘁 𝗜 𝘄𝗶𝘀𝗵 𝗜 𝗵𝗮𝗱. It's a curated collection of strategies I've learned from people smarter than me and tools I've created to organize my hiring efforts. Download it free from the Featured section or in the comments below. 🧩Click [+ Follow] for more", "content_media": "https://media.licdn.com/dms/image/C5622AQFkt9nhOenfxg/feedshare-shrink_800/0/1668518107170?e=1686787200&v=beta&t=wD1AqHwWivTfdXZ9kMzS6EpGMCvfc5kVlg2_tuDRlW8", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6998272208766722048", "number_of_likes": 8, "number_of_comments": 1}, {"content_of_the_post": "You either move closer to or further from the goal🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQHq5u1PcXY_Dw/feedshare-shrink_800/0/1668471306341?e=1686787200&v=beta&t=gJkDw9F2ul74r7qY2wTsQLnLHUYuZjV39n7EJXBW_yc", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6998075933001740288", "number_of_likes": 18, "number_of_comments": 0}, {"content_of_the_post": "I like this framework from McKinsey & Company but they got one thing wrong 👇They identify 3 keys to faster, better decisions (below). But I don’t know why they consider hiring as low-risk and frequent for most managers.It’s quite the opposite. From a manager's perspective, hiring is high-impact and very infrequent (i.e. difficult to get good at), which is why it's risky.Even from a company's perspective, hiring might be frequent (i.e. it's happening all the time, somewhere), but it is not low-risk.Do you consider hiring a High or Low risk activity?🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQEGj1HXT7usPw/feedshare-shrink_800/0/1668431703103?e=1686787200&v=beta&t=8pT1ujWyBO_IF4pf7IMEel7FqzdJaakTweSclXEp_7I", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6997909793084497921", "number_of_likes": 5, "number_of_comments": 5}, {"content_of_the_post": "Eric Brummel captured Earth spinning through space 👇Incredible how this short time-lapse shows so clearly something we are aware of but usually cannot perceive.Astrophotographers achieve this effect with a motorized Equatorial Mount, compensating for Earth's rotation, so the camera stays fixed on the celestial object. 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQGjKzKlSUyY4g/feedshare-shrink_800/0/1668386930000?e=1686787200&v=beta&t=HgDOI7NPF2Jtdm7HAkqUsNA-BQqsPoewzZZ8WCAebSA", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6997721978501554178", "number_of_likes": 14, "number_of_comments": 8}, {"content_of_the_post": "A little window of Consciousness 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQEioFhJAinUjQ/feedshare-shrink_800/0/1668345305556?e=1686787200&v=beta&t=a6gBinOQNoqGZq0LK7dRuDOfiBkKaoYHT8SghRkux2U", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6997547441063436288", "number_of_likes": 11, "number_of_comments": 2}, {"content_of_the_post": "I recently learned about @eLegend, a “Retrofuturistic Full Electric Supercar” reinterpreting the rally legend Audi Sport Quattro from the 1980s.I can see how bringing back old models with electric propulsion could become a real trend. What retrofuturistic car you'd love to see?I'll go first: Lancia Delta Integrale🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQHs243e2ssG6A/feedshare-shrink_800/0/1668298506524?e=1686787200&v=beta&t=OHKQ4bQ4uKAmtB1yGhsKc0B9LYX23rgtFz-amf96DFk", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6997351124731142144", "number_of_likes": 10, "number_of_comments": 5}, {"content_of_the_post": "Proof that pragmatic innovation is the key to success🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQF6z7um-9M5TA/feedshare-shrink_800/0/1668258903842?e=1686787200&v=beta&t=1BJyaicU24KNVN1VvFEpOoTT6DkH-e2aH7r--_KlHmA", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6997185027721637888", "number_of_likes": 13, "number_of_comments": 3}, {"content_of_the_post": "Today I completed the first week entirely dedicated to my new role in product management 👇It's like drinking from a firehose, of course. But I've learned more about the company's inner workings and met more new people in the past five days than in the previous year.For many new employees, it would be an excellent training and networking opportunity to spend a couple of weeks shadowing a product manager when they first join.I'm going to put a note in the suggestion box near the water cooler.🧩", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6996977407651975169", "number_of_likes": 35, "number_of_comments": 0}, {"content_of_the_post": "For anyone looking for a new snowboard design 👇🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQGSSUDJDoHI7w/feedshare-shrink_800/0/1668131279635?e=1686787200&v=beta&t=rkarc2BI25BJo4FpbS6crcyKPM4bNrBLvw3tyhYawDA", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6996649701710200832", "number_of_likes": 9, "number_of_comments": 3}, {"content_of_the_post": "As someone that enjoys systems, playbooks and streamlining processes, this hit close to home 😁 I’ve been there many times. Still worth it. I’m currently looking at ways to automate inventory reporting. We’ll see how it goes. 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQFExt3QjtbO8Q/feedshare-shrink_800/0/1668046147215?e=1686787200&v=beta&t=UZKXo_zCSyTK0Edpt1qmQx3ZF4aqmEjpeKNoF5E8JZw", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6996292633144827904", "number_of_likes": 26, "number_of_comments": 20}, {"content_of_the_post": "Unpopular opinion: this Tweet is about leadership 👇🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQE0IbKBsmidyg/feedshare-shrink_800/0/1667958697529?e=1686787200&v=beta&t=iCHt4Ay-BaLW2K6UcnYBQ9-Ss89Z2FEj17eusSa_gA8", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6995925843881459712", "number_of_likes": 34, "number_of_comments": 18}, {"content_of_the_post": "I’ve been in (physical) product management for literally a couple of days, and I already participated in discussions about the following:• Inventory management • Campaign management• Process managementI love it!🧩", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6995373065203331072", "number_of_likes": 12, "number_of_comments": 1}, {"content_of_the_post": "Ri-pubblico per gli amici italiani (e non):Lo Studio Capello é una delle realtà più competenti ed innovative del settore legale 👇", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6995356440823549952", "number_of_likes": 2, "number_of_comments": 0}, {"content_of_the_post": null, "content_media": "https://media.licdn.com/dms/image/C5622AQFnDKE_CA8pRA/feedshare-shrink_800/0/1667740503465?e=1686787200&v=beta&t=Uf0H26EuHP_XbsXxY3z3USuQYffdCXJKl3coIKx3Xw4", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6995010713190621184", "number_of_likes": 17, "number_of_comments": 3}, {"content_of_the_post": "To my fellow Canadians: how accurate is this? Very, Somewhat or Not-at-all accurate? 👇", "content_media": "https://media.licdn.com/dms/image/C5622AQEC7-ZqHlEzjA/feedshare-shrink_800/0/1667651358625?e=1686787200&v=beta&t=VUW22v5rRnzBe0lBp_gmLZE6MlqBGDIjgaEdu6t9104", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6994636770579550208", "number_of_likes": 12, "number_of_comments": 3}, {"content_of_the_post": "To my fellow Canadians: how accurate is this? Very, Somewhat or Not-at-all accurate? 👇", "content_media": "https://media.licdn.com/dms/image/C5622AQEFg9obcCqlBQ/feedshare-shrink_800/0/1667651105974?e=1686787200&v=beta&t=9iJfybumj2Ena4RInJVKOd0ebVl1rwNZ8eQdCmg28gs", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6994635747576213504", "number_of_likes": 1, "number_of_comments": 2}, {"content_of_the_post": "I’m wrapping up the week with a few wins:• A cliffhanger project is wrapping up juuuust in time • I got unsolicited positive feedback about a team member• A connection made a few weeks ago is leading to a possible career discussion for another team member • My backfill is a great leader who will take on my former team without skipping a beatTonight I am celebrating 🍷 Have a great weekend, everyone! 🧩", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6994430662799749120", "number_of_likes": 14, "number_of_comments": 3}, {"content_of_the_post": "What a great quote 👇", "content_media": "https://media.licdn.com/dms/image/C4E22AQGxgoNtHyx3Hw/feedshare-shrink_800/0/1667515062867?e=1686787200&v=beta&t=SQlszjkWC29fEKkawBwhyqRueDyAtxhEsaaRHZ3JzVw", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6994065101397852160", "number_of_likes": 44, "number_of_comments": 1}, {"content_of_the_post": "To my friends in SaaS software development:", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6993749310534279168", "number_of_likes": 4, "number_of_comments": 1}, {"content_of_the_post": "Apparently there is a good amount of quality research suggesting that binaural beats of 40 Hz can shift the brain into a very focused state. It increases concentration and cognition, mainly if used for 5 minutes before starting mentally demanding work. I’ll try it out next time I’m doing some Deep Work (e.g. year-end comments and evaluations). 🧩", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6993349123517136897", "number_of_likes": 7, "number_of_comments": 3}, {"content_of_the_post": "Today I started a new role as Sr Technical Product Manager for TELUS Business Wi-Fi. After several years in Systems Strategy and in Project Delivery, getting closer to the Customer again is exciting.I look forward to working with the Sales, Marketing, Fulfillment, Care and Systems teams in this new mandate.  I'm grateful for the outstanding people I got to work with over the years, the leaders I've been coached by and the friendships I've made. Your kind comments over the past few days were heartwarming.I am eager to learn about this side of the business and looking forward to whatever this new adventure may bring. Let's go.🧩", "content_media": "https://media.licdn.com/dms/image/D5622AQF7zR8UXNVU-Q/feedshare-shrink_800/0/1667251510459?e=1686787200&v=beta&t=3TCp_tMBn8mO9omBiY5-AgMwGAlMTrEMH7FT9YNqjZk", "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6992959711981551616", "number_of_likes": 111, "number_of_comments": 65}, {"content_of_the_post": "Happy Halloween 🎃 👻 💀", "content_media": null, "date": "November-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6992958140925300736", "number_of_likes": 1, "number_of_comments": 1}, {"content_of_the_post": "Speak up. We, collectively, need your ideas and contribution.🧩", "content_media": "https://media.licdn.com/dms/image/C4E22AQHovMq0EkL4pw/feedshare-shrink_800/0/1667132108242?e=1686787200&v=beta&t=wFveKn4CSvjB0vrQc9VhLAKF2NMSeUsuDOjO-V13MLQ", "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6992458914860560384", "number_of_likes": 19, "number_of_comments": 2}, {"content_of_the_post": "Friendly reminder that the year is 83% done, and there are 9 weeks left until 2023. #FinishStrong🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQFOOojqR6rVEg/feedshare-shrink_800/0/1667045706030?e=1686787200&v=beta&t=Cg5tBvRFwillMN_2J-Alyo1jO4UyhAMNyRNyf_rHXOU", "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6992096506111557632", "number_of_likes": 2, "number_of_comments": 0}, {"content_of_the_post": "Yesterday I was looking at the nominations for a prestigious company award. There must have been over 300 pictures, with people from all business functions.I was happy to find many deserving team members I’ve met and worked with over the years.And what a beautifully multicultural and multifaceted team! Proud. 🧩", "content_media": null, "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6991898177905856512", "number_of_likes": 8, "number_of_comments": 0}, {"content_of_the_post": "This morning I was listening to an interview with James Clear about how the environment around us drives our habits unconsciously. The point is to be deliberate about how we organize our surroundings, to facilitate good habits and dissuade bad ones. This applies to both physical and digital environments. So I’m testing a couple of ideas mentioned in the interview: 1. Rearrange the Home Screen to include only essential apps2. Use black and white screen settings to reduce the allure of the colourful “eye candy” appsThis is going to be interesting. 🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQEQ501iuDpolg/feedshare-shrink_800/0/1666908787363?e=1686787200&v=beta&t=2qpMTQQyQaSGQ1hrFkhF0f6x1EP6aHoYPcIYYmSWxcE", "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6991522199178276864", "number_of_likes": 18, "number_of_comments": 3}, {"content_of_the_post": "I found this graph helps to put in context the current economic outlook.During an average Bear market (i.e. when securities fall for a sustained amount of time), the S&P “𝘩𝘢𝘴 𝘴𝘭𝘪𝘥 𝘢𝘣𝘰𝘶𝘵 38% 𝘰𝘷𝘦𝘳 15 𝘵𝘰 16 𝘮𝘰𝘯𝘵𝘩𝘴 𝘣𝘦𝘧𝘰𝘳𝘦 𝘳𝘦𝘢𝘤𝘩𝘪𝘯𝘨 𝘢 𝘣𝘰𝘵𝘵𝘰𝘮.”🧩", "content_media": "https://media.licdn.com/dms/image/D5622AQFlWpk_8OsZLA/feedshare-shrink_800/0/1666825304285?e=1686787200&v=beta&t=AF-JtJ-VDXXaz6CV5kkf7XeEor0fx9jEI5sEonWKmRs", "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6991172044994334720", "number_of_likes": 9, "number_of_comments": 1}, {"content_of_the_post": "One year ago today, I challenged myself to post on LinkedIn daily for a year. Here are 5 of the lessons I've learned 👇1. 𝗧𝗵𝗲 𝗳𝗶𝗿𝘀𝘁 𝘀𝘁𝗲𝗽 𝗶𝘀 𝘁𝗵𝗲 𝗵𝗮𝗿𝗱𝗲𝘀𝘁 𝗼𝗻𝗲. One of the early challenges was overcoming the feeling that the knowledge or insights I have to share are obvious. It turns out they aren't.2. 𝗕𝗲 𝗰𝗼𝗺𝗳𝗼𝗿𝘁𝗮𝗯𝗹𝗲 𝘄𝗶𝘁𝗵 𝗮𝗺𝗯𝗶𝗴𝘂𝗶𝘁𝘆. I've no idea what will resonate. Some of what I thought was my best content would be ignored. While something I wrote almost in passing would become a popular piece. 3. 𝗖𝘂𝘀𝘁𝗼𝗺𝗲𝗿𝘀 𝗱𝗲𝗳𝗶𝗻𝗲 𝗩𝗮𝗹𝘂𝗲. I used to think that Quality matters more than Quantity. I now believe you need Quantity (i.e. volume, data points) to understand what Quality looks like to my customers. That's because my own definition of Value might be way off. 4. 𝗣𝗲𝗿𝘀𝗼𝗻𝗮𝗹 𝗦𝘁𝗼𝗿𝘆𝘁𝗲𝗹𝗹𝗶𝗻𝗴 𝗶𝘀 𝘁𝗵𝗲 𝘀𝗵𝗼𝗿𝘁𝗲𝘀𝘁 𝗱𝗶𝘀𝘁𝗮𝗻𝗰𝗲 𝗯𝗲𝘁𝘄𝗲𝗲𝗻 𝗽𝗲𝗼𝗽𝗹𝗲. Writing about how the topic at hand relates to me personally, even if only in a small way, will make it resonate more. For example, when I write about my journey or the World seen through my daughter's eyes. 5. 𝗙𝗶𝗻𝗱 𝗮 𝗻𝗲𝘁𝘄𝗼𝗿𝗸𝗶𝗻𝗴 𝗮𝗽𝗽𝗿𝗼𝗮𝗰𝗵 𝘁𝗵𝗮𝘁 𝘄𝗼𝗿𝗸𝘀 𝗳𝗼𝗿 𝘆𝗼𝘂. I (wrongly) used to think that networking was about self-involved superficial conversations. However, through the daily posting, I discovered a new angle to networking that made it click for me. 🧩", "content_media": "https://media.licdn.com/dms/image/D5622AQENtMSKAm392g/feedshare-shrink_800/0/1666700103132?e=1686787200&v=beta&t=Q2_pdv9lvvWqVk9rwwWAExJ4eQjtCJK6pdhit1lCl-A", "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6990646957471920128", "number_of_likes": 43, "number_of_comments": 10}, {"content_of_the_post": "Today we are launching a new set of features and hundreds of UI/UX improvements to several thousands of our users.That’s the final stretch of a 15 months project involving 30+ groups, 100s of business primes and countless planning, development and testing hours. And it’s the critical step because 𝗨𝘀𝗲𝗿 𝗔𝗱𝗼𝗽𝘁𝗶𝗼𝗻 𝗶𝘀 𝘄𝗵𝗲𝗿𝗲 𝗕𝘂𝘀𝗶𝗻𝗲𝘀𝘀 𝗩𝗮𝗹𝘂𝗲 𝗶𝘀 𝗳𝗶𝗻𝗮𝗹𝗹𝘆 𝗿𝗲𝗮𝗹𝗶𝘇𝗲𝗱. It’s going to be a busy week 💪🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQH2Ya6u7NuRrg/feedshare-shrink_800/0/1666613708375?e=1686787200&v=beta&t=aux-Xrw3SeCF3IsXWJDn239BsUx3AaP_Fa6tpwLiDyo", "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6990284578183680001", "number_of_likes": 7, "number_of_comments": 0}, {"content_of_the_post": null, "content_media": "https://media.licdn.com/dms/image/C5622AQHQS3KEVZWd9g/feedshare-shrink_800/0/1666527302906?e=1686787200&v=beta&t=Ma_0NQmn1VC-erDPJt32THCxIdyneIZM5e0bMYV8TRQ", "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6989922184336986112", "number_of_likes": 13, "number_of_comments": 0}, {"content_of_the_post": "If a Spotify playlist was a Digital Product Manager... 😁A surprisingly good listen!🧩", "content_media": "https://media.licdn.com/dms/image/C4E22AQHfkBezPq_7-w/feedshare-shrink_800/0/1666440904362?e=1686787200&v=beta&t=dPUn4nz-UwMn4hU4hDLLiGerL-tjG5BdBTTeiZnIaX8", "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6989559802125254656", "number_of_likes": 16, "number_of_comments": 1}, {"content_of_the_post": "This is how I realized I'm not cut for a role in corporate marketing:During my second year at a leading Canadian telecommunication company that shall remain nameless, I was sitting on a marketing call for an upcoming campaign.We spent 20 minutes deciding whether the most suitable critter was a bunny or a piglet.I decided right there it was not for me.What was your I need to change something moment?🧩", "content_media": null, "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6989197357015842816", "number_of_likes": 10, "number_of_comments": 2}, {"content_of_the_post": "Here's a talent acquisition pool that's way underused:𝗧𝗵𝗲 𝗿𝘂𝗻𝗻𝗲𝗿-𝘂𝗽 𝗰𝗮𝗻𝗱𝗶𝗱𝗮𝘁𝗲𝘀 𝘆𝗼𝘂 𝗱𝗶𝗱𝗻'𝘁 𝗵𝗶𝗿𝗲 𝗹𝗮𝘀𝘁 𝘁𝗶𝗺𝗲.I don't know why we tend to start from scratch every time we have a new opening.Instead, look at the shortlist of previous candidates. It's a potential gold mine. Do you have one talent acquisition trick you can share?🧩", "content_media": null, "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6988834974258921472", "number_of_likes": 9, "number_of_comments": 0}, {"content_of_the_post": "One of the mistakes I made as a new manager was looking for the best people to join my team. Instead, I should have focused more time and energy on accountability, coaching and career planning for the people already there with me.It seems obvious in retrospect, but sometimes the easier lessons are learned the hard way.What mistakes have you made early on as a manager?🧩", "content_media": null, "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6988472607410982912", "number_of_likes": 12, "number_of_comments": 7}, {"content_of_the_post": "I was listening to an interview about hiring talent, and the CEO of this company said they approach the application generation system for Candidates like the lead generation system for Sales 💡To me, that means things like:- The job title becomes your headline - Speed and responsiveness are critical- Nurture the candidates that didn’t make it yetWhat else?🧩", "content_media": null, "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6988121767852613632", "number_of_likes": 7, "number_of_comments": 5}, {"content_of_the_post": "I think this is an excellent definition of two critical business skillsets:Management deals with Complexity. Leadership deals with Change.🧩", "content_media": "https://media.licdn.com/dms/image/C5622AQHE-flNdmYxtA/feedshare-shrink_800/0/1666031418238?e=1686787200&v=beta&t=9jGFd0FPrP9wpnbWz1o3C5ZsiVB0-QINDOzDrjTZyl8", "date": "October-2022", "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:6987842297493168129", "number_of_likes": 12, "number_of_comments": 1}]